conf/src/Catalogs/ЭП_ВидыЗадачи/ЭП_ВидыЗадачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭП_ВидыЗадачи</name>
  <owners>Catalog.Проекты</owners>
</mdclass:Catalog>

conf/src/Catalogs/ЭП_НаборыВидовЗадач/ЭП_НаборыВидовЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭП_НаборыВидовЗадач</name>
  <owners>Catalog.Проекты</owners>
  <tabularSections>
    <name>ВидыЗадач</name>
    <attributes>
      <name>ВидЗадачи</name>
      <type>
        <types>CatalogRef.ЭП_ВидыЗадачи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

conf/src/Catalogs/ЭП_ВидыЗадачи/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Проект.Пустая() Тогда
		Объект.Владелец = Параметры.Проект;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		ЗаписыватьВидЗадачиВНабор = Истина;	
	КонецЕсли;
	
	Если Параметры.НеДобавлятьВидЗадачиВНабор Тогда
		ЗаписыватьВидЗадачиВНабор = Ложь;
	КонецЕсли;  
	
	Если Не Параметры.Владелец = ПредопределенноеЗначение("Справочник.Проекты.ПустаяСсылка") Тогда
		Объект.Владелец = Параметры.Владелец;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ЗаписыватьВидЗадачиВНабор Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭП_НаборыВидовЗадач.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЭП_НаборыВидовЗадач КАК ЭП_НаборыВидовЗадач
	|ГДЕ
	|	ЭП_НаборыВидовЗадач.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Объект.Владелец);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ПараметрыОтбора = Новый Структура("ВидЗадачи", Объект.Ссылка); 
	
	Пока Выборка.Следующий() Цикл
		
		ДанныеНабора = Выборка.Ссылка.ПолучитьОбъект(); 
		
		Если ДанныеНабора.ВидыЗадач.НайтиСтроки(ПараметрыОтбора).Количество() = 0 Тогда 
			
			НоваяСтрока = ДанныеНабора.ВидыЗадач.Добавить();
			НоваяСтрока.ВидЗадачи = Объект.Ссылка;
			
		КонецЕсли;
		
		ДанныеНабора.Записать();
		
	КонецЦикла;
	
КонецПроцедуры  

Функция ПолучитьИмяСправочника()
	Возврат Объект.Ссылка.Метаданные().Имя;	
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ИмяОбъекта = ПолучитьИмяСправочника();
    СтрРеквизитов = Новый Структура; 
    СтрРеквизитов.Вставить("Наименование", Объект.Наименование);
	СтрРеквизитов.Вставить("Владелец", Объект.Владелец);
	
	Если Не ЭП_ОбщегоНазначенияСервер.ПроверитьУникальностьОбъектаПоРеквизитам("Справочник", ИмяОбъекта, СтрРеквизитов, Объект.Ссылка) Тогда 
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Подобный элемент справочника «" + Объект.Наименование + "» существует!
                |Модуль: Контроль уникальности элементов справочника." );
        Отказ = Истина; 
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
